거래 처 중... 1번 주문 후 안 한 사람들에게 문자 보내기
2번 이상 주문 자 중 외상금 0원인데 3달 이상 주문 안한 사람 문자 보내기
유승희는 딸기(딸기이름)
유명재도 딸기(딸기오빠)

추론(물어봐야함)
하모니C마트(진천군)  -> 
이경식  ->코사마트 고현점

--======================================================================================================
--출금 기본 조회
--======================================================================================================
SELECT  입금일, 출금액, 입금액, 거래잔액, 거래내용, 입금자, 거래점, 거래내역, 상태
FROM     입출금_보경
WHERE 
입금액 is null 
and 상태 is null
--order by 출금액 desc
ORDER BY 입금일
--======================================================================================================
--상가월세
--======================================================================================================
SELECT  입금일, 출금액, 입금액, 거래잔액, 거래내용, 입금자, 거래점, 거래내역, 상태
FROM     입출금_보경
WHERE 
 (입금자 LIKE '%김홍숙%') or   
 (입금자 LIKE '%상가 월세%')
ORDER BY 입금일

select * from 입출금_보경
where 출금액=660000
--아직 7월, 9월, 11월, 12월, 1월을 못 찾음
--======================================================================================================
--상가관리비 - 경방
--======================================================================================================
SELECT  입금일, 출금액, 입금액, 거래잔액, 거래내용, 입금자, 거래점, 거래내역, 상태
FROM     입출금_보경
WHERE 
입금액 is null 
and 
(
 (입금자 LIKE '%이소양%')    or 
 (거래내역 LIKE '%관리%')    or 
 (입금자 LIKE '%신영%')    or (입금자 LIKE '%정양호(신영인력공%') or (거래내역 LIKE '%신영%')   
)
ORDER BY 입금일
--============================================================================================================================================================================================================
--======================================================================================================
--주유
--======================================================================================================
SELECT  입금일, 출금액, 입금액, 거래잔액, 거래내용, 입금자, 거래점, 거래내역, 상태
FROM     입출금_보경
WHERE 
입금액 is null 
and 상태 is null
and 
(
 (입금자 LIKE '%주유%')   
)
ORDER BY 입금일
--============================================================================================================================================================================================================
--======================================================================================================
--kt 박현정(kt 박현정)
--======================================================================================================
SELECT  입금일, 출금액, 입금액, 거래잔액, 거래내용, 입금자, 거래점, 거래내역, 상태
FROM     입출금_보경
WHERE 
입금액 is null 
and 상태 is null
and 
(
 (입금자 LIKE '%박현정(KT)%')   
)
ORDER BY 입금일
--======================================================================================================
--======================================================================================================
--강민경- 분당제생병원
--======================================================================================================
SELECT  입금일, 출금액, 입금액, 거래잔액, 거래내용, 입금자, 거래점, 거래내역, 상태
FROM     입출금_보경
WHERE 
입금액 is null 
and 상태 is null
and 
(
 (입금자 LIKE '%(의)대진의료재단분당제생병원%')   
)
ORDER BY 입금일
--======================================================================================================
--======================================================================================================
--LG 유플러스 - 강민경
--======================================================================================================
SELECT  입금일, 출금액, 입금액, 거래잔액, 거래내용, 입금자, 거래점, 거래내역, 상태
FROM     입출금_보경
WHERE 
입금액 is null 
and 상태 is null
and 
(
 (입금자 LIKE '%LG유플러스%')   
)
ORDER BY 입금일
--======================================================================================================

--======================================================================================================
--횡령자금(박현정) - KT 는 전화비, 삼천 은 가스비
--======================================================================================================
SELECT  입금일, 출금액, 입금액, 거래잔액, 거래내용, 입금자, 거래점, 거래내역, 상태
FROM     입출금_보경
WHERE 
입금액 is null 
and 
(
 (입금자 LIKE '%박현정%')   
)
ORDER BY 입금일
--======================================================================================================
--======================================================================================================
--급여(유승희)
--======================================================================================================
SELECT  입금일, 출금액, 입금액, 거래잔액, 거래내용, 입금자, 거래점, 거래내역, 상태
FROM     입출금_보경
WHERE 
입금액 is null 
and 상태 is null
and 
(
 (입금자 LIKE '%유승희%')   or
 (입금자 LIKE '%유명재%')   
)
ORDER BY 입금일
--======================================================================================================
--======================================================================================================
--잡 지출 ( 은행이자, 결산소득세, 지방세, 인터넷상거래 등)
--======================================================================================================
SELECT  입금일, 출금액, 입금액, 거래잔액, 거래내용, 입금자, 거래점, 거래내역, 상태
FROM     입출금_보경
WHERE 
입금액 is null 
and 상태 is null
and 
(
 (거래내용 LIKE '%결산소득세%')   or --결산소득세
 (입금자 LIKE '%용인시(박현%') or  --지방세
 (입금자 LIKE '%인터넷상거래%')  --잡 수수료
)
ORDER BY 입금일
--======================================================================================================
--택배(정유경- 로젠, 남민우-cj, 롯데택배)
--======================================================================================================
SELECT  입금일, 출금액, 입금액, 거래잔액, 거래내용, 입금자, 거래점, 거래내역, 상태
FROM     입출금_보경
WHERE 
입금액 is null 
and 상태 is null
and 
(
 (입금자 LIKE '%정유경%')    or
 (입금자 LIKE '%남민우%')   or
 (입금자 LIKE '%롯데택배%')   
)
ORDER BY 입금일
--======================================================================================================
--의료비(병원, 약국, 병원내 매점)
--======================================================================================================
SELECT  입금일, 출금액, 입금액, 거래잔액, 거래내용, 입금자, 거래점, 거래내역, 상태
FROM     입출금_보경
WHERE 
입금액 is null 
and 상태 is null
and 
(
 (입금자 LIKE '%행복한약국%')    or
 (입금자 LIKE '%상생약국%')   or
 (입금자 LIKE '%구스토커피숍(제생병원내)%')    or
 (입금자 LIKE '%차호인정형외과의원%')   
)
ORDER BY 입금일

--======================================================================================================
--변동지출 - 우체국
--======================================================================================================
SELECT  입금일, 출금액, 입금액, 거래잔액, 거래내용, 입금자, 거래점, 거래내역, 상태
FROM     입출금_보경
WHERE 
입금액 is null 
and 상태 is null
and 
(
 (입금자 LIKE '%우정%')    
)
ORDER BY 입금일

--======================================================================================================
--변동지출 - 식료품 구입, 문구, 자동차
--======================================================================================================
SELECT  입금일, 출금액, 입금액, 거래잔액, 거래내용, 입금자, 거래점, 거래내역, 상태
FROM     입출금_보경
WHERE 
입금액 is null 
and 상태 is null
and 
(
 (입금자 LIKE '%남동%') or  (입금자 LIKE '%오피스%')  or
 (입금자 LIKE '%다이소%')  or (입금자 LIKE '%자동차%')  or (입금자 LIKE '%네이버페이%')    or
 (거래내역 LIKE '%반품%')   or (입금자 LIKE '%비에이치씨(BHC)풍덕천점%')  or (입금자 LIKE '%이바돔죽전점%')    or
 (입금자 LIKE '%이니시스-멜론2%')    or   (입금자 LIKE '%명가정육점식당%')    or (입금자 LIKE '%히포커피(HIPPOCOFFEE)%')    or
 (입금자 LIKE '%CU수지수진점%')    or (입금자 LIKE '%소문난떡집%')    or (입금자 LIKE '%주식회사나무유통%')    or
 (입금자 LIKE '%떡볶이창고%')    or  (입금자 LIKE '%에뛰드하우스수지점%')    or (입금자 LIKE '%롯데리아수지풍덕천점%')    or
 (입금자 LIKE '%신선설농탕수지점%')    or (입금자 LIKE '%사오정%')    or (입금자 LIKE '%외래식당%')    or
 (입금자 LIKE '%못된고양이%')    or (입금자 LIKE '%미니스톱수지거묵점%')    or (입금자 LIKE '%CGV죽전(매점)%')    or
 (입금자 LIKE '%KSNET-통방판(일반)%')    or (입금자 LIKE '%성지슈퍼%')    or   (입금자 LIKE '%(주)이마트수지점%')    or 
  (입금자 LIKE '%(주)농협하나로유통성남농산물종합유통센터%')    or   (입금자 LIKE '%미소야수지풍덕천점%')    or 
  (입금자 LIKE '%송혜교%')   or
  (입금자 LIKE '%(주)TS에프씨앤씨파파이스충무로점%')   
)
ORDER BY 입금일

--======================================================================================================
--매입거래처 
--======================================================================================================
SELECT  입금일, 출금액, 입금액, 거래잔액, 거래내용, 입금자, 거래점, 거래내역, 상태
FROM     입출금_보경
WHERE 
입금액 is null 
and 상태 is null
and 
(
 (입금자 LIKE '%국일%') or (입금자 LIKE '%강다연(국일식품)%') 
  or (입금자 LIKE '%류희승%') 
  or (입금자 LIKE '%백송식품(주)%') 
  or (입금자 LIKE '%김창수%')   --디자인하우스
  or (입금자 LIKE '%권미%')   -- 원팩  
  or (입금자 LIKE '%(주)경진기업%')   -- 견과믹스 용기  
  or (입금자 LIKE '%두리%') 
  or (입금자 LIKE '%삼흥%')  or (입금자 LIKE '%주식회사 삼%')
  or (입금자 LIKE '%해왕%') 
  or (입금자 LIKE '%김태호%') --실링기 수리
  or (입금자 LIKE '%(주)예다원%') --삼계탕재료
  or (입금자 LIKE '%팩플러스%')   --포장비닐  
  or (입금자 LIKE '%한국식품산%')   --한국식품산 (
  or (입금자 LIKE '%디팩%') or (입금자 LIKE '%위도희%') 
  or (입금자 LIKE '%머거본%') or (입금자 LIKE '%이은호%') 
  or (입금자 LIKE '%주문수%') or (입금자 LIKE '%이숙영%') 
  or (입금자 LIKE '%주문수%') or (입금자 LIKE '%조현묵%') 
  or (입금자 LIKE '%우종환%') --숏다리  
  or (입금자 LIKE '%박애정%')  
  or (입금자 LIKE '%유한회사 세무법인이%') -- 세무법인
  
)
ORDER BY 입금일

--======================================================================================================
--매출 빈도수 체크
--======================================================================================================
SELECT  입금자, max(입금일) as 입금일,  max(출금액) as 출금액, count(*) as cnt
FROM     입출금_보경
WHERE  (상태 IS NULL) AND (출금액 IS NOT NULL)
group by 입금자
ORDER BY cnt desc
--============================================================================================================
-- 예금이자
select *
	from [dbo].[입출금_보경]
where
(거래내용 like '%예금이자%')
order by 입금일

-- 국세환급금
select *
	from [dbo].[입출금_보경]
where
(입금자 like '%세무서%')
order by 입금일

-- 케이씨피
select *
	from [dbo].[입출금_보경]
where
(입금자 like '%케이씨피%')
order by 입금일

--======================================================================================================
--거래내역 워킹 테이블로 복사
--======================================================================================================
--============================================================================================================================================================================================================
insert into 농협통장_보경(입금일, 입금액, 입금자,거래내용, 거래점)

select convert(varchar(50), a.입금일, 121) as 입금일, a.입금액, a.입금자 , a.거래내용, a.거래점-- , b.입금일
	from [dbo].[입출금_보경] a left join 농협통장_보경 b on a.입금일=b.입금일 and a.입금액=b.입금액 and a.입금자=b.입금자
where
a.입금액 is not null and  b.입금일 is null
and (a.거래내용 not like '%예금이자%')
and (a.입금자 not like '%세무서%')
and (a.입금자 not like '%케이씨피%')
order by   a.입금일
--======================================================================================================
--제대로 입금처리를 위한 창 띄우고 작업 시작 
--======================================================================================================
SELECT  입금일, 입금액, 거래점, 입금자, 코멘트, 매입처리상태, 회사명, 거래내용
FROM     농협통장_보경
WHERE  (입금자 LIKE '%김보람%') OR
       (회사명 LIKE '%ㅁ%')
ORDER BY 입금일
--======================================================================================================
--입금처리를 위한 조회
--======================================================================================================
SELECT   입금일, 입금액, 입금자,거래점, 매입처리상태, 회사명, 코멘트,up_Date
,거래내용
FROM     농협통장_보경
where 
	(매입처리상태 is  null 	or
	매입처리상태 not in  
	( '1','못찾음','확인') 
	or	회사명 is  null  )
	and 입금자 not in  ( '케이씨피','강다혁','박현정','관리비환급') 
order by 입금일 
--======================================================================================================
--입금액으로 사용자 찾기
--======================================================================================================
SELECT   입금일, 입금액, 입금자,거래점, 매입처리상태, 회사명, 코멘트,up_Date, 거래내용
FROM     농협통장_보경
where 
	입금액=202000
order by 입금일 

--======================================================================================================
--일자별매출 전표에서 사용자 찾기
--======================================================================================================
SELECT  * FROM     일자별매출전표_보경
where 
	매출=2000000
	or 수금액 =2000000
	--or 거래처명 ='코사마트 고현점'
order by 전표일자
--======================================================================================================
--농협통장에서 날짜와 입금액으로 찾기
--======================================================================================================
select * from 농협통장_보경 
where 입금일>='2017-07-01' and 입금액=70600
order by 입금일
--======================================================================================================
--농협통장에서 거래점으로 찾기
--======================================================================================================
select * from 농협통장_보경 
where 거래점='국민0040879'
order by 입금일


select * from 입출금_보경
order by  입금일

select * from 농협통장_보경
order by  입금일
--================================================================================================================================
-- 문자보내기
--================================================================================================================================
select a.거래처, b.대표전화, b.휴대폰 from [dbo].[거래처_임시_7월문자용] a
left join [dbo].[거래처_임시_7월연락처] b
on a.거래처=b.거래처
where a.거래처 not in ('통운고객만족', '일반판매','세일세일마트(울산신정)','현대홈마트(논현점)','한양동슈퍼','월DC할인마트(포항)','하늘마트'
,'한성마트(경북영주)','스피드마트(우정점)','아림마트(부산 연산3동)','산호마트(보령)','부림홈마트(대구 대명11동)'
,'대창슈퍼(군산)','삼거리슈퍼(경북 수비)','미니슈퍼(경북구미)','한아름슈퍼','무지개마트','코사마트(등대마트)','행신 웨이팅'
,'송원마트(구례)','위드미 용인모현점','백양슈퍼','금토슈퍼(성남 금토동)','G마트(안동)','현대식품','우리슈퍼(경기 의정부)'
,'황매산휴게소','두연유통','하모니마트(군포)','하모니마트(김포)','우성슈퍼(구미동)','늘푸른마트(파주)','동네방네 편의점','후레쉬마트(공주)'
,'진로마트(한국마트)','한아름마트(천안 쌍용동)','빙그레마트(전남 완도)','뉴 알파마트(잠실)','H마트(춘천 후평동)','매일슈퍼'
,'웰빙마트(경북 영주)','산곡마트(인천 부평구)','동고령농협 우곡지소 하나로마트','영화슈퍼(부안군)','이지마트','대우할인마트(부천)'
,'장군노래연습장','한오숙님(경기 부천)','박현정,강다혁','금성슈퍼','블루마트(경남 통영)','이서방슈퍼'
)
and ( b.대표전화 is not null and b.휴대폰 is not null)
order by 휴대폰, 대표전화
--

select  * from 입출금
where 어느통장 in(41)
order by 입금일 desc

select  * --, sum( 출금액) 
from 입출금
where  어느통장 in(93,71)
and 입금일 >='2016-07-01'
 and 입금자  in (
'삼성06-053회'
,'삼성06-055회'
,',연세우유강릉'
,'농협생명20회'
,'[061]3978023'
,'UMS수수료'
)


-- 신규 업체들 사업자 등록증 안 받은것 받자
-- 미수가 없고 휴대번호가 있는 분들에게는 sms 를 발송하자

--*******************입출금 테이블에서 농협통장으로 copy 날짜 바꿔서**********************************
select * from 입출금 
-- where 입금액=62500   -- 입금액으로
where 어느통장=41
order by 입금일 desc


-- 잘못 입력된것.. 수정해라
select * from 입출금 where 출금액 is null and 입금액 is null


--*********입출금 통장 전년 대비 월 통계***************************
select sum(입금액) as 입금액 from 농협통장_보경 
where 입금일 >='2016-05-01'  and 입금일< '2016-06-01'

select sum(입금액) as 입금액 from 농협통장_보경 
where 입금일 >='2017-05-01'  and 입금일< '2017-06-01'

select sum(입금액) as 입금액 from 농협통장_보경 
where 입금일 >='2018-05-01'  and 입금일< '2018-06-01'

--******** 전체 가장 많이 주문한 고객 ************************
select 회사명, sum(입금액) as 입금액 from 농협통장_보경
where 회사명 is not null
group by 회사명
order by 입금액 desc

select 회사명, sum(입금액) as 입금액 from 농협통장_보경
where 회사명 is not null
and 입금일 >= '2018-04-01' and 입금일 < '2018-05-01'
group by 회사명
order by 입금액 desc

select 회사명, sum(입금액) as 입금액 from 농협통장_보경
where 회사명 is not null
and 입금일 >= '2018-05-01' and 입금일 < '2018-06-01'
group by 회사명
order by 입금액 desc




--************일자별매출전표에서 찾기********
select * from 일자별매출전표
where 매출=43000 or 수금액=43000
order by  전표일자 desc
--************최근 입출금 통장********
select * from 입출금
where 입금액=171000
order by  입금일 desc

--************처리 해야 할것 들********
select 2925000 - 2385000



--*****************-----------------------------------
--일자별 매출 전표에서 입금액으로 못찾은 사람 찾아보기
select * from 일자별매출전표
where 매출=194000
order by 전표일자 desc





--1. 2016-08-03 	896,100	하조대농협 은 누구?
--2. 2016-08-05 759,000	하조대현북 누구?
--3. 2016-08-08 	257,500	임현주 누구?
--4. 원풍슈퍼(순천 풍덕) 1천원 초과 입금 처리 함. 
--5. 영춘마트(여주)  1,500원 미달 입금 처리함.
--6. 강서미니슈퍼 32,500원 입금?, 미달 입금 처리함.
--7. 강원농산 8월 3일 576,500원  제대로는 입금확인되었는데 통장에서는 못찾음
--8. 하나유통(삼양)  8월8일 10만원 제대로는 입금확인 되었는데 통장에서 못찾음
-- ** 중앙마트(경기이천) 제대로만 보고 입금확인이 안되었다고 문자해서 돈을 다시 넣은것 같음.. 환불해주라

--뉴마트롯데캐슬점_부산 입금문자

-- 입금액으로
--********입금액으로 사람 찾기************************************
select  입금일, 입금액, 입금자, 매입처리상태, 회사명, 코멘트,거래점
from [dbo].[농협통장]
where 회사명='강원농산'
where   입금액 = 118400 -- 81,000 11건
order by 입금일

select  *
from [dbo].[입출금]
where 입금일 >='2016-08-03' and 입금일 <'2016-08-04'
--where 입금자='최규훈'
where   입금액 = 127000 -- 81,000 11건
order by 입금일

select * from 일자별매출전표
where   (매출 = 118400) or (수금액=118400) 
order by 전표일자 



2015-08-20 00:00:00.000	황금DC창고(울산)	290500
2016-05-02 00:00:00.000	농민마트(서산)	290500

끝.

--하루 매출은 얼마인가
select  * from 농협통장
where 입금일>='2016-05-12' and 입금일<'2016-05-13'

select  sum(입금액) from 농협통장
where 입금일>='2016-05-12' and 입금일<'2016-05-13'
매출 3,681,615
입금 2,127,090
입금액이 너무 적다... 일 100차이라....
-- 바로 미수금 현황 확인

-- 미수금 1주단위 업데이트
--1. 미수금날짜 테이블 만들고
select * into 미수금리스트_20161210 from 미수금리스트_20161128 where 1=2

--2. 제대로 에서 외상값 0 초과 인것들 테이블에 복사
    -- 수동
--3.  업데이트
update a
set a.[코멘트]=b.코멘트, a.정렬넘버=b.정렬넘버, a.마지막미수거래일=b.마지막미수거래일
from 
 미수금리스트_20161210 a join 
 미수금리스트_20161128 b on a.거래처명=b.거래처명   -- 바로 전 테이블의 내용을 복사
 -- 미수금 1주단위 업데이트 끝
 
 --4. 일자별 매출 전표 업데이트 [제대로에서 전표일자는 어제껏 까지 뽑아 줘잉]
 select * from [dbo].[일자별매출전표]    
 --where 거래처명='현대마트 휴게실(군산)'
 order by  전표일자 desc
 --4.1 일자별 매출 전표 테이블에 데이타 복사 하고

 --5. 미수금 리스트
-- 미수금 (제대로 ) 지점 특별관리
select b.전표일자, a.휴대전화, a.대표전화, a.거래처명, a.미수금, a.정렬넘버,a.코멘트  
from 미수금리스트_20161210 a Left join
(
	select 거래처명, max(전표일자) as 전표일자 from [dbo].[일자별매출전표]    
	--where 영업담당='용인'
	where 거래처명 not in  (	
	--솔로몬
	'두연유통' , '하모니마트(군포)', '하모니마트(김포)'
	-- 전표이상
	,'국화우성마트', '한길유통'	
	)	
	group by 거래처명	
	-- order by max(전표일자)
) b on a.거래처명=b.거래처명 
where a.미수금 > 0 and b.거래처명 is not null and 전표일자 < dateadd(day, -55, getdate())
   --order by a.정렬넘버 desc, a.미수금 desc
  order by a.정렬넘버, b.전표일자 desc, a.미수금 desc
  --order by a.미수금 desc
  
  order by b.전표일자 desc, a.미수금 desc

  
--**********1번 QA 에서 확인하는 용도
-- 최근 한달간 입금완료 회사명
select 회사명, sum(입금액) as amount from  농협통장
where 입금일 >='2016-01-01'  and 입금일 < '2016-06-01'
group by 회사명
with cube
order by amount desc

select 59149720 -55395930 = 3753790
select 전표 - 통장 = 차이   -- 우리유통이 대충 707,000, 삽교마트(충남예산) 가 대략 717,000
 전표다운 받아서 대사작업 하자...일단은 미수 부터

--먼저 현재 전표 일자가 어디까지 인가?
declare @maxDate datetime
select @maxDate = dateadd(day, -1, max(전표일자)) from  일자별매출전표  --  전표일자에서 해당 일 부터 조회하여 테이블에 입력하고

select * from 일자별매출전표 
order by 전표일자 desc

select * from 일자별매출전표 
where 전표일자 > @maxDate



--------------통계----------------------------------------------------------------------------------------
--	select * from #imsiTran
--	select * from #imsiDeposit

	select a.company, a.amount as T_amount, b.amount as D_amount
	 from #imsiTran a left join #imsiDeposit b on a.company=b.company
	 order by D_amount 
		
		select * from 농협통장 where 입금자 like '%참조%' or 회사명 like '%참좋은마트(충북청주)%'
		select * from 일자별매출전표 where 거래처명 like '%우주마트%'
		select * from 농협통장 where 입금일 >='2015-06-25'and 입금일 <'2016-10-22'  and 입금액 in (100000)  ,		

		
113600,
101000,
60800,
109700)
		
		insert into 농협통장 (입금일, 입금액, 입금자, 매입처리상태, 주문일, 회사명)
		values('2014-12-08', 66000, '종점슈퍼(울릉)', '확인', '2014-12-08', '종점슈퍼(울릉)')

---------------------------------------------------------------------------------------------------
---------------------------------------------------------------------------------------------------


-- 최근 한달간 주문 회사명
select 회사명, sum(입금액) as amount from  농협통장
where 입금일 >='2016-06-01'  and 입금일 < '2016-07-01'
group by 회사명
with cube
order by amount desc







-- 월별 무통장 입금액 -- 홈페이지는 별개
SELECT convert(varchar(7), 입금일, 121) as 입금월,  
	SUBSTRING(CONVERT(varchar, CAST(sum(입금액) AS money), 1), 0,
	Len(CONVERT(varchar, CAST(sum(입금액) AS money), 1) )-2)  as amount 
from  농협통장
where 입금일 >='2014-08-01'  and 입금일 < '2016-04-01'
group by convert(varchar(7), 입금일, 121)
order by convert(varchar(7), 입금일, 121)


--**********특정 주문일이후 현재까지 미수금 금액 랭킹************************
select 회사명, max(현재미수금) as 미수금,max(주문일) as 최근주문일  from 농협통장
where 현재미수금 is not null and 회사명 is not null
and 주문일 >='2014-09-01' 
group by 회사명
order by max(현재미수금) desc

--**********미수금  오래된 랭킹  [처리해야 함]************************
select 회사명, max(현재미수금), max(주문일) from 농협통장
where 현재미수금 is not null  and 현재미수금 > 0
group by 회사명
order by max(주문일)

--**********월별 미수금 ************************
select convert(varchar(7), 입금일, 121), sum(현재미수금) from 농협통장
where 현재미수금 is not null and 회사명 is not null
and 입금일 >='2015-06-01' 
group by convert(varchar(7), 주문일, 121)
with cube

--**********총 미수금 ************************
select sum(현재미수금) from 농협통장
where 현재미수금 is not null and 회사명 is not null
and 입금일 >='2015-06-01' 
group by convert(varchar(7), 입금일, 121)


--***********미수확인*************************************************
SELECT  TOP (200) 주문일, 입금일, 입금액, 입금자, 매입처리상태, 회사명, 코멘트,현재미수금
FROM     농협통장 
where 
코멘트 like '%미수%' and 현재미수금 is  not  null
order by 회사명, 입금일

select 회사명, max(입금일), max(현재미수금)
from 농협통장
group by 회사명

--*******주문일이 입금일보다 빠른거(수동입력 실수)******************
select * from 농협통장
where 주문일 is not null
and 주문일 > 입금일

select * from 업체정보

--******몰아서 입금 계산***************************************************
select 28000 + 32500 + 50500

select 643000 - 397000

--*******입금확인처리 쿼리로***********************************************
begin tran
--update 농협통장
--set 회사명 = '강화수퍼', 매입처리상태='확인' where 입금자 = '신형식'

select * from 농협통장 where 입금자 like '%양영%'

commit tran

--=====================미수 관련===============================
--국일
-- 없어야 함.
select 회사명,  count(*) from [dbo].[미수160419]
group by 회사명
having  count(*) > 1

-- 총 미수 금액 91,087,877 -- 한길 1천 빼야 함.
select sum(외상금액) from [dbo].[미수160419]


-- 현재 일 기준 1개월 안에 거래 안한 외상 있는 아이들
	select * 
	from
	(
		select  회사명, 대표전화, 휴대전화, 외상금액 from [dbo].[미수160419] a where 회사명 not in
			(select 회사명 from 농협통장
				where 입금일 > dateadd( day, -1, getdate())
			group by 회사명
			) 
	) x
	order by x.외상금액 desc
-==================================================================

--********입금액으로 사람 찾기************************************
select  입금일, 입금액, 입금자, 매입처리상태, 회사명, 코멘트
from [dbo].[농협통장]
where   입금액 = 209500 -- 81,000 11건
order by 입금일

select * from 일자별매출전표
where   (매출 = 290500) or (수금액=290500) 
order by 전표일자 

select * from 입출금
where   입금액 = 79000
order by 입금일

select * from 입출금
where 입금자='강다혁'

